[
  "consistent-attachments-and-links",
  "code-block-copy",
  "cm-editor-syntax-highlight-obsidian",
  "find-unlinked-files",
  "footlinks",
  "obsidian-footnotes",
  "obsidian-git",
  "remember-cursor-position",
  "unique-attachments",
  "obsidian-admonition",
  "obsidian-mind-map",
  "url-into-selection",
  "obsidian-excalidraw-plugin",
  "better-word-count",
  "highlightr-plugin",
  "obsidian-image-toolkit",
  "obsidian-tracker",
  "calendar",
  "table-editor-obsidian",
  "obsidian-reading-time"
]